app/views/signups/edit.html.erb

SELECT "events".* FROM "events"
---
  <h3>  <%= f.label :event_id %>
    <%= f.collection_select :event_id, Event.all, :id, :title %>