app/views/signups/new.html.erb

  <h3>  <%= f.label :event_id %>
    <%= f.collection_select :event_id, Event.all, :id, :title %>
---
SELECT "events".* FROM "events"